; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v6 ?v2)
             (pred_8 ?v4 ?v9)
             (pred_9 ?v6 ?v9)
             (pred_1 ?v12 ?v6 )
	     (pred_2 ?v6)
             (pred_10 ?v3)
             (pred_5 ?v4)
             (pred_11 ?v9)
             (pred_6 ?v6)
             (pred_4 ?v4)
             (pred_12 ?v6)
             (pred_7 ))



(:action op_4
:parameters (?v1 ?v13 ?v8 ?v5)
:precondition (and (pred_10 ?v1) (pred_10 ?v13) (pred_5 ?v8) (pred_11 ?v5)
          (pred_3 ?v1 ?v13) (pred_8 ?v8 ?v5)
                   (pred_9 ?v13 ?v5) (pred_2 ?v1) 
                   (pred_6 ?v13) (pred_4 ?v8))
:effect (and  (pred_12 ?v13) (not (pred_6 ?v13))))


(:action op_1
:parameters (?v1 ?v11)
:precondition (and (pred_10 ?v1) (pred_10 ?v11)
               (pred_2 ?v1) (pred_3 ?v1 ?v11) (pred_12 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v1))))

(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_10 ?v1) (pred_5 ?v8) 
                  (pred_2 ?v1) (pred_1 ?v8 ?v1) (pred_7 ))
:effect (and (pred_4 ?v8)
   (not (pred_1 ?v8 ?v1)) (not (pred_7 ))))


(:action op_2
:parameters (?v1 ?v10 ?v7)
:precondition (and (pred_10 ?v1) (pred_5 ?v10) (pred_5 ?v7)
                  (pred_2 ?v1) (pred_4 ?v7) (pred_1 ?v10 ?v1))
:effect (and (pred_4 ?v10) (pred_1 ?v7 ?v1)
        (not (pred_4 ?v7)) (not (pred_1 ?v10 ?v1))))

(:action op_5
:parameters (?v1 ?v8)
:precondition (and (pred_10 ?v1) (pred_5 ?v8) 
                  (pred_2 ?v1) (pred_4 ?v8))
:effect (and (pred_7 ) (pred_1 ?v8 ?v1) (not (pred_4 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_14 obj_15 obj_09 obj_20 obj_19 obj_06 obj_10 obj_18 obj_17 obj_07 obj_12 obj_03 obj_11 obj_02 obj_08
    obj_01 obj_05
    obj_04 obj_16
    )

    (:init
       (pred_7)

       (pred_10 obj_13)
       (pred_10 obj_14)
       (pred_10 obj_15)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_11 obj_01)
       (pred_11 obj_05)
       (pred_5 obj_04)
       (pred_5 obj_16)

       (pred_3 obj_13 obj_20)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_19 obj_06)
       (pred_3 obj_19 obj_14)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_06 obj_19)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_12 obj_07)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_02 obj_08)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_02)
       (pred_6 obj_03)
       (pred_6 obj_13)
       (pred_9  obj_03 obj_01)
       (pred_9  obj_13 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_06)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_12 obj_08)

       (pred_8  obj_04 obj_01)
       (pred_8  obj_16 obj_05)
       (pred_1 obj_04 obj_17)
       (pred_1 obj_16 obj_08)
       (pred_2 obj_18)
    )

    (:goal (and
       (pred_1 obj_04 obj_14)
       (pred_1 obj_16 obj_02)
    ))
(:constraints
  (always (not (pred_2 obj_07)))
)
)

; plan
1. (op_1 obj_18 obj_17)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_17)
   goals met: 0 of 2
2. (op_3 obj_17 obj_04)
   deleted: (pred_1 obj_04 obj_17) (pred_7)
   added: (pred_4 obj_04)
   goals met: 0 of 2
3. (op_1 obj_17 obj_19)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_19)
   goals met: 0 of 2
4. (op_1 obj_19 obj_06)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_06)
   goals met: 0 of 2
5. (op_1 obj_06 obj_10)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_10)
   goals met: 0 of 2
6. (op_1 obj_10 obj_12)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_12)
   goals met: 0 of 2
7. (op_1 obj_12 obj_08)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_08)
   goals met: 0 of 2
8. (op_2 obj_08 obj_16 obj_04)
   deleted: (pred_4 obj_04) (pred_1 obj_16 obj_08)
   added: (pred_4 obj_16) (pred_1 obj_04 obj_08)
   goals met: 0 of 2
9. (op_1 obj_08 obj_02)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_02)
   goals met: 0 of 2
10. (op_5 obj_02 obj_16)
   deleted: (pred_4 obj_16)
   added: (pred_7) (pred_1 obj_16 obj_02)
   goals met: 1 of 2
11. (op_1 obj_02 obj_08)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_08)
   goals met: 1 of 2
12. (op_3 obj_08 obj_04)
   deleted: (pred_1 obj_04 obj_08) (pred_7)
   added: (pred_4 obj_04)
   goals met: 1 of 2
13. (op_1 obj_08 obj_12)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_12)
   goals met: 1 of 2
14. (op_1 obj_12 obj_10)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_10)
   goals met: 1 of 2
15. (op_1 obj_10 obj_09)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_09)
   goals met: 1 of 2
16. (op_1 obj_09 obj_15)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_15)
   goals met: 1 of 2
17. (op_1 obj_15 obj_14)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_14)
   goals met: 1 of 2
18. (op_5 obj_14 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_7) (pred_1 obj_04 obj_14)
   goals met: 2 of 2
